CSI API ETABS v1

# cSapModelGetModelFilepath Method

---

Returns the filepath of the current model

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    string GetModelFilepath()

    Function GetModelFilepath As String

    Dim instance As cSapModel
    Dim returnValue As String

    returnValue = instance.GetModelFilepath()

    String^ GetModelFilepath()

    abstract GetModelFilepath : unit -> string

#### Return Value

Type: String
Returns a string that represents the filepath of the current model

Remarks

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com